; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	image2 - mode
	infrared1 - mode
	spectrograph0 - mode
	image3 - mode
	Star0 - direction
	GroundStation1 - direction
	Star2 - direction
	Star3 - direction
	Star5 - direction
	Star7 - direction
	GroundStation12 - direction
	Star14 - direction
	GroundStation16 - direction
	Star17 - direction
	Star18 - direction
	Star8 - direction
	GroundStation15 - direction
	Star6 - direction
	Star21 - direction
	Star23 - direction
	Star20 - direction
	GroundStation9 - direction
	GroundStation22 - direction
	GroundStation11 - direction
	GroundStation10 - direction
	Star13 - direction
	GroundStation19 - direction
	GroundStation24 - direction
	Star4 - direction
	Phenomenon25 - direction
	Star26 - direction
	Phenomenon27 - direction
	Star28 - direction
	Phenomenon29 - direction
	Star30 - direction
	Phenomenon31 - direction
	Planet32 - direction
	Star33 - direction
	Planet34 - direction
	Phenomenon35 - direction
	Planet36 - direction
	Planet37 - direction
	Phenomenon38 - direction
	Phenomenon39 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 infrared1)
	(supports instrument0 image2)
	(calibration_target instrument0 GroundStation24)
	(calibration_target instrument0 GroundStation15)
	(calibration_target instrument0 GroundStation10)
	(calibration_target instrument0 Star4)
	(calibration_target instrument0 GroundStation22)
	(calibration_target instrument0 Star8)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star5)
	(supports instrument1 image2)
	(supports instrument1 spectrograph0)
	(supports instrument1 image3)
	(calibration_target instrument1 Star6)
	(supports instrument2 spectrograph0)
	(supports instrument2 image2)
	(supports instrument2 image3)
	(calibration_target instrument2 Star21)
	(calibration_target instrument2 Star13)
	(supports instrument3 infrared1)
	(calibration_target instrument3 GroundStation24)
	(calibration_target instrument3 GroundStation19)
	(calibration_target instrument3 Star20)
	(calibration_target instrument3 Star23)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet32)
	(supports instrument4 image2)
	(calibration_target instrument4 Star4)
	(calibration_target instrument4 GroundStation9)
	(supports instrument5 image2)
	(supports instrument5 infrared1)
	(supports instrument5 image3)
	(calibration_target instrument5 GroundStation19)
	(calibration_target instrument5 Star13)
	(calibration_target instrument5 GroundStation10)
	(calibration_target instrument5 GroundStation11)
	(calibration_target instrument5 GroundStation22)
	(supports instrument6 image2)
	(supports instrument6 image3)
	(calibration_target instrument6 Star4)
	(calibration_target instrument6 GroundStation24)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star23)
)
(:goal (and
	(have_image Phenomenon25 infrared1)
	(have_image Star26 spectrograph0)
	(have_image Phenomenon27 image2)
	(have_image Star28 spectrograph0)
	(have_image Phenomenon29 infrared1)
	(have_image Star30 image2)
	(have_image Phenomenon31 infrared1)
	(have_image Planet32 image3)
	(have_image Star33 spectrograph0)
	(have_image Planet34 spectrograph0)
	(have_image Phenomenon35 image2)
	(have_image Planet36 image2)
	(have_image Planet37 image3)
	(have_image Phenomenon38 image2)
	(have_image Phenomenon39 image2)
))

)

; plan
1. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 15
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 15
3. (turn_to satellite0 phenomenon25 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 phenomenon25)
   goals met: 0 of 15
4. (turn_to satellite1 star21 planet32)
   deleted: (pointing satellite1 planet32)
   added: (pointing satellite1 star21)
   goals met: 0 of 15
5. (calibrate satellite1 instrument2 star21)
   added: (calibrated instrument2)
   goals met: 0 of 15
6. (turn_to satellite1 phenomenon27 star21)
   deleted: (pointing satellite1 star21)
   added: (pointing satellite1 phenomenon27)
   goals met: 0 of 15
7. (take_image satellite1 phenomenon27 instrument2 image2)
   added: (have_image phenomenon27 image2)
   goals met: 1 of 15
8. (turn_to satellite1 phenomenon35 phenomenon27)
   deleted: (pointing satellite1 phenomenon27)
   added: (pointing satellite1 phenomenon35)
   goals met: 1 of 15
9. (take_image satellite1 phenomenon35 instrument2 image2)
   added: (have_image phenomenon35 image2)
   goals met: 2 of 15
10. (turn_to satellite1 phenomenon38 phenomenon35)
   deleted: (pointing satellite1 phenomenon35)
   added: (pointing satellite1 phenomenon38)
   goals met: 2 of 15
11. (take_image satellite1 phenomenon38 instrument2 image2)
   added: (have_image phenomenon38 image2)
   goals met: 3 of 15
12. (turn_to satellite1 phenomenon39 phenomenon38)
   deleted: (pointing satellite1 phenomenon38)
   added: (pointing satellite1 phenomenon39)
   goals met: 3 of 15
13. (take_image satellite1 phenomenon39 instrument2 image2)
   added: (have_image phenomenon39 image2)
   goals met: 4 of 15
14. (turn_to satellite1 planet32 phenomenon39)
   deleted: (pointing satellite1 phenomenon39)
   added: (pointing satellite1 planet32)
   goals met: 4 of 15
15. (take_image satellite1 planet32 instrument2 image3)
   added: (have_image planet32 image3)
   goals met: 5 of 15
16. (turn_to satellite1 planet34 planet32)
   deleted: (pointing satellite1 planet32)
   added: (pointing satellite1 planet34)
   goals met: 5 of 15
17. (take_image satellite1 planet34 instrument2 spectrograph0)
   added: (have_image planet34 spectrograph0)
   goals met: 6 of 15
18. (turn_to satellite1 planet36 planet34)
   deleted: (pointing satellite1 planet34)
   added: (pointing satellite1 planet36)
   goals met: 6 of 15
19. (take_image satellite1 planet36 instrument2 image2)
   added: (have_image planet36 image2)
   goals met: 7 of 15
20. (turn_to satellite1 planet37 planet36)
   deleted: (pointing satellite1 planet36)
   added: (pointing satellite1 planet37)
   goals met: 7 of 15
21. (take_image satellite1 planet37 instrument2 image3)
   added: (have_image planet37 image3)
   goals met: 8 of 15
22. (turn_to satellite1 star26 planet37)
   deleted: (pointing satellite1 planet37)
   added: (pointing satellite1 star26)
   goals met: 8 of 15
23. (take_image satellite1 star26 instrument2 spectrograph0)
   added: (have_image star26 spectrograph0)
   goals met: 9 of 15
24. (turn_to satellite1 star28 star26)
   deleted: (pointing satellite1 star26)
   added: (pointing satellite1 star28)
   goals met: 9 of 15
25. (take_image satellite1 star28 instrument2 spectrograph0)
   added: (have_image star28 spectrograph0)
   goals met: 10 of 15
26. (turn_to satellite1 star30 star28)
   deleted: (pointing satellite1 star28)
   added: (pointing satellite1 star30)
   goals met: 10 of 15
27. (take_image satellite1 star30 instrument2 image2)
   added: (have_image star30 image2)
   goals met: 11 of 15
28. (turn_to satellite1 star33 star30)
   deleted: (pointing satellite1 star30)
   added: (pointing satellite1 star33)
   goals met: 11 of 15
29. (take_image satellite1 star33 instrument2 spectrograph0)
   added: (have_image star33 spectrograph0)
   goals met: 12 of 15
30. (turn_to satellite0 star8 phenomenon25)
   deleted: (pointing satellite0 phenomenon25)
   added: (pointing satellite0 star8)
   goals met: 12 of 15
31. (calibrate satellite0 instrument0 star8)
   added: (calibrated instrument0)
   goals met: 12 of 15
32. (turn_to satellite0 phenomenon25 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 phenomenon25)
   goals met: 12 of 15
33. (take_image satellite0 phenomenon25 instrument0 infrared1)
   added: (have_image phenomenon25 infrared1)
   goals met: 13 of 15
34. (turn_to satellite0 phenomenon29 phenomenon25)
   deleted: (pointing satellite0 phenomenon25)
   added: (pointing satellite0 phenomenon29)
   goals met: 13 of 15
35. (take_image satellite0 phenomenon29 instrument0 infrared1)
   added: (have_image phenomenon29 infrared1)
   goals met: 14 of 15
36. (turn_to satellite0 phenomenon31 phenomenon29)
   deleted: (pointing satellite0 phenomenon29)
   added: (pointing satellite0 phenomenon31)
   goals met: 14 of 15
37. (take_image satellite0 phenomenon31 instrument0 infrared1)
   added: (have_image phenomenon31 infrared1)
   goals met: 15 of 15
